app/Controllers/Data.php

SELECT *
FROM `ecp`
ORDER BY `id` ASC
SELECT COUNT(*) AS `numrows`
FROM `ecp`
---
    public function getECP(){
        $ecp = new EcpModel();
		$query = $ecp->orderBy('id','ASC')->findAll();
		$count = $ecp->orderBy('id','ASC')->countAllResults();

SELECT *
FROM `user_online`
WHERE `uid` = 0
ORDER BY `id` ASC
 LIMIT 1
---
    public function checkonline(){
        $online = new UserOnlineModel();
        $query = $online->asArray()->where(['uid' => session()->get('userid')])->orderBy('id','asc')->first();