app/Controllers/Keyin.php

SELECT *
FROM `jobtask`
WHERE DATE_FORMAT(callJabdate, "%Y-%m-%d %H:%i") <= '2024-11-26 12:16'
AND `jobStatus` = 2
SELECT *
FROM `jobtask`
WHERE DATE_FORMAT(updateqcdate, "%Y-%m-%d %H:%i") <= '2024-11-26 12:16'
AND `callQC` = 'Y'
AND `comment` IS NULL
AND `QCStatus` IS NULL
AND `commentQC` IS NULL
---
    public function returnjobEvery30m(){
        $jobtask = new JobtaskModel();
        $thirtyMinutesAgo = date('Y-m-d H:i', strtotime('-30 minutes')); // แก้ไขเป็น 30 นาที

        // ค้นหางานที่มี callJabdate เก่ากว่า 30 นาที
        $tasks = $jobtask->where('DATE_FORMAT(callJabdate, "%Y-%m-%d %H:%i") <=', $thirtyMinutesAgo) // แก้ไขรูปแบบวันที่
                         ->where('jobStatus', 2) // เปลี่ยนตามสถานะที่ต้องการ
                         ->findAll();
        // ค้นหางานที่มี callJabdate เก่ากว่า 30 นาที
        $tasksQC = $jobtask->where('DATE_FORMAT(updateqcdate, "%Y-%m-%d %H:%i") <=', $thirtyMinutesAgo) // แก้ไขรูปแบบวันที่
                         ->where('callQC', 'Y') // เปลี่ยนตามสถานะที่ต้องการ
                         ->where('comment IS NULL', NULL ,true)
                         ->where('QCStatus IS NULL', NULL ,true)
                         ->where('commentQC IS NULL', NULL ,true)
                         ->findAll();