app/Controllers/QCAnswer.php

    public function myCalljobqc(){
        $task = new JobtaskModel();
        $commentType = new commentTypeModel();
        $data['commentType'] = $commentType->where(['commentType' => 'qc'])->orderBy('id','ASC')->findAll();
---
SELECT *
FROM `comment_type`
WHERE `commentType` = 'qc'
ORDER BY `id` ASC