app/Controllers/Support.php

    public function CreateTransactionSupport(){
        $add = $this->request->getPost();
        $actionTypeFlag = $add['actionTypeFlag'];
        // สร้างอินสแตนซ์ของโมเดล SupportJob
        $supportJobModel = new supportJobModel();
        // สร้างรหัสธุรกรรมแบบสุ่ม 8 หลัก
        $transactionCode = sprintf('%08d', mt_rand(0, 99999999));

        // เพิ่มรหัสธุรกรรมเข้าไปในข้อมูลที่จะบันทึก
        $add['transactionCode'] = $transactionCode;
        // เตรียมข้อมูลสำหรับการบันทึก
        $data = [
            'transactionCode' => $transactionCode,
            'ticketcode' => $add['ticketid'],
            'trackingNo' => $add['trackingid'],
            'ref_tracking' => $add['reftrackingno'],
            'contactType' => $add['contactType'],
            'contactName' => $add['contactName'],
            'actionType' => $add['actionType'],
            'comment' => $add['comment'],
            'createUser' => session()->get('m_name'),
            'createDate' => date('Y-m-d H:i:s'),
            'status' => 1
        ];
---
SELECT *
FROM `contactType`
ORDER BY `id` ASC