app/Models/JobtaskModel.php

SELECT COUNT(*) AS `numrows`
FROM `jobtask` `jt`
WHERE `jt`.`QCStatus` IS NULL
AND jt.trackingId IS NOT NULL
AND `jt`.`jobStatus` = 3
AND `jt`.`calljob` = 'Y'
AND jt.comment is NULL
AND DATE(jt.updatedate) = '2024-11-27'
SELECT COUNT(*) AS `numrows`
FROM `jobtask` `jt`
WHERE jt.trackingId IS NOT NULL
AND `jt`.`QCStatus` = 4
AND DATE(jt.`updateqcdate`) = '2024-11-27'
---
    public function CountJobtask() {
        $db = db_connect();
        $today = date('Y-m-d');
        $month = date('Y-m');

        // Count tasks that are waiting for QC (QCStatus is NULL, trackingId is not NULL, jobStatus = 3, and calljob = 'Y')
        $builder = $db->table('jobtask jt');
        $builder->select('id');
        $builder->where('jt.QCStatus', NULL, TRUE);
        $builder->where('jt.trackingId IS NOT NULL', NULL, FALSE);
        $builder->where('jt.jobStatus', 3);
        $builder->where('jt.calljob', 'Y');
        $builder->where('jt.comment is NULL', null, false);
        $builder->where('DATE(jt.updatedate)', $today);
        $countwait = $builder->countAllResults();

        // Count tasks that have passed QC (QCStatus is not NULL)
        $builder = $db->table('jobtask jt');
        $builder->select('id');
        // $builder->where('jt.comment IS NOT NULL', null, false);
        $builder->where('jt.trackingId IS NOT NULL', NULL, FALSE);
        $builder->where('jt.QCStatus',4);
        $builder->where('DATE(jt.`updateqcdate`)', $today);
        $countpass = $builder->countAllResults();

SELECT *
FROM `jobtask` `jt`
WHERE `jt`.`jobStatus` = 3
AND `jt`.`calljob` = 'Y'
AND jt.comment is NULL
AND jt.QCStatus is NULL
AND jt.callQC is NULL
AND jt.callQCuser is NULL
ORDER BY `jt`.`createdate` ASC
 LIMIT 10
---
    public function updateCallQC(){
        $db = db_connect();
        $builder = $db->table('jobtask jt');
        $builder->select('*');
        $builder->where(['jt.jobStatus' => 3]);
        $builder->where(['jt.calljob' => 'Y']);
        $builder->where('jt.comment is NULL', null, false);
        $builder->where('jt.QCStatus is NULL', null, false);
        $builder->where('jt.callQC is NULL', null, false);
        $builder->where('jt.callQCuser is NULL', null, false);
        $builder->limit(10);
        $builder->orderBy('jt.createdate', 'ASC');
        $query = $builder->get();